package com.random.food;

public class FoodData {
    // TODO : 이미지를 추가하고 싶을 경우 아래 추석을 해제하고 이미지명, 음식 이름 으로 따로 바꿔줘야함 
    private static final String[] KOREAN_FOOD = new String[] {
            // 통큰돼지국밥, 후문포차, 신전떡볶이 중복데이터
            "본죽","한솥도시락","울엄마 부대찌개","신전떡볶이","바우네나주곰탕","통묵은지감자탕",
            "부산돼지국밥","밥장인 돼지찌개","밀리오레","통큰돼지국밥","오봉도시락",
            "진미","경아","땡초김밥","오늘김해뒷고기","동궁찜닭","국수나무","남매컵밥","돼지랑 순대랑"
    };

    private static final String[] CHINESE_FOOD = new String[] {
        "비샤몬텐","스시하루","카메","사누끼우동","정스시","쇼우도우","이에케이 라멘","개척초밥","쇼우다이",
        "시마다","스시도","엔동","겐코","돈브로"
    };

    private static final String[] JAPANESE_FOOD = new String[] {
        "라화쿵부","수해복마라탕","이비가짬뽕","라맛쿵부","북경양꼬치","미향루",
        "천안문","동향","고량진미","이서방짬뽕","삼양콩짜장","착한쭝식","역전반점","9찌짬뽕",
        "홍콩반점","만성각","소림마라","서울손짜장","탕슈탕슈","갈비짬뽕엔탕수육","짬뽕공장"
    };

    private static final String[] FOOD = new String[] {
        "델브리또","에그드랍", "도스마스","버거킹","필로돈테리아",
        "롯데리아","피자헛","미스터피자","아웃닭","맥도날드","맘스터치",
        "도미노피자","임실치즈피자","고피자","멘탈비히클","피나치공","어니언스","굽네치킨","BHC",
        "BBQ","꼬꼬아찌","멕시카나","조커닭","닭제이","바쿠스","버거앤프라이즈"
    };

    private static final String[] ALL_FOOD = new String[] {
            "본죽","한솥도시락","울엄마 부대찌개","신전떡볶이","바우네나주곰탕","통묵은지감자탕",
            "부산돼지국밥","밥장인 돼지찌개","밀리오레","통큰돼지국밥","오봉도시락",
            "진미","경아","땡초김밥","오늘김해뒷고기","동궁찜닭","국수나무","남매컵밥","돼지랑 순대랑",

            "비샤몬텐","스시하루","카메","사누끼우동","정스시","쇼우도우","이에케이 라멘","개척초밥","쇼우다이",
            "시마다","스시도","엔동","겐코","돈브로",

            "라화쿵부","수해복마라탕","이비가짬뽕","라맛쿵부","북경양꼬치","미향루",
            "천안문","동향","고량진미","이서방짬뽕","삼양콩짜장","착한쭝식","역전반점","9찌짬뽕",
            "홍콩반점","만성각","소림마라","서울손짜장","탕슈탕슈","갈비짬뽕엔탕수육", "짬뽕공장",

            "델브리또","에그드랍", "도스마스","버거킹","필로돈테리아",
            "롯데리아","피자헛","미스터피자","아웃닭","맥도날드","맘스터치",
            "도미노피자","임실치즈피자","고피자","멘탈비히클","피나치공","어니언스","굽네치킨","BHC",
            "BBQ","꼬꼬아찌","멕시카나","조커닭","닭제이","바쿠스","버거앤프라이즈"
    };

    public static String[] getKoreanFood() {
        return KOREAN_FOOD;
    }

    public static String[] getChineseFood() {
        return CHINESE_FOOD;
    }

    public static String[] getJapaneseFood() {
        return JAPANESE_FOOD;
    }

    public static String[] getFood() {
        return FOOD;
    }

    public static String[] getAllFood() {
        return ALL_FOOD;
    }
}
